module.exports = {
	hindi: {
		dohaTop: `श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि.
बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि.`,
		chopai: `जय हनुमान ज्ञान गुन सागर,
जय कपीस तिहुं लोक उजागर.
 
रामदूत अतुलित बल धामा,
अंजनि-पुत्र पवनसुत नामा.
 
महाबीर बिक्रम बजरंगी,
कुमति निवार सुमति के संगी.
 
कंचन बरन बिराज सुबेसा,
कानन कुंडल कुंचित केसा.
 
हाथ बज्र औ ध्वजा बिराजै,
कांधे मूंज जनेऊ साजै.
 
संकर सुवन केसरीनंदन,
तेज प्रताप महा जग बन्दन.
 
विद्यावान गुनी अति चातुर,
राम काज करिबे को आतुर.
 
प्रभु चरित्र सुनिबे को रसिया,
राम लखन सीता मन बसिया.
 
सूक्ष्म रूप धरि सियहिं दिखावा,
बिकट रूप धरि लंक जरावा.
 
भीम रूप धरि असुर संहारे,
रामचंद्र के काज संवारे.
 
लाय सजीवन लखन जियाये,
श्रीरघुबीर हरषि उर लाये.
 
रघुपति कीन्ही बहुत बड़ाई,
तुम मम प्रिय भरतहि सम भाई.
 
सहस बदन तुम्हरो जस गावैं,
अस कहि श्रीपति कंठ लगावैं.
 
सनकादिक ब्रह्मादि मुनीसा,
नारद सारद सहित अहीसा.
 
जम कुबेर दिगपाल जहां ते,
कबि कोबिद कहि सके कहां ते.
 
तुम उपकार सुग्रीवहिं कीन्हा,
राम मिलाय राज पद दीन्हा.
 
तुम्हरो मंत्र बिभीषन माना,
लंकेस्वर भए सब जग जाना.
 
जुग सहस्र जोजन पर भानू,
लील्यो ताहि मधुर फल जानू.
 
प्रभु मुद्रिका मेलि मुख माहीं,
जलधि लांघि गये अचरज नाहीं.
 
दुर्गम काज जगत के जेते,
सुगम अनुग्रह तुम्हरे तेते.
 
राम दुआरे तुम रखवारे,
होत न आज्ञा बिनु पैसारे.
 
सब सुख लहै तुम्हारी सरना,
तुम रक्षक काहू को डर ना.
 
आपन तेज सम्हारो आपै,
तीनों लोक हांक तें कांपै.
 
भूत पिसाच निकट नहिं आवै,
महाबीर जब नाम सुनावै.
 
नासै रोग हरै सब पीरा,
जपत निरंतर हनुमत बीरा.
 
संकट तें हनुमान छुड़ावै,
मन क्रम बचन ध्यान जो लावै.
 
सब पर राम तपस्वी राजा,
तिन के काज सकल तुम साजा.
 
और मनोरथ जो कोई लावै,
सोइ अमित जीवन फल पावै.
 
चारों जुग परताप तुम्हारा,
है परसिद्ध जगत उजियारा.
 
साधु-संत के तुम रखवारे,
असुर निकंदन राम दुलारे.
 
अष्ट सिद्धि नौ निधि के दाता,
अस बर दीन जानकी माता.
 
राम रसायन तुम्हरे पासा,
सदा रहो रघुपति के दासा.
 
तुम्हरे भजन राम को पावै,
जनम-जनम के दुख बिसरावै.
 
अन्तकाल रघुबर पुर जाई,
जहां जन्म हरि-भक्त कहाई.
 
और देवता चित्त न धरई,
हनुमत सेइ सर्ब सुख करई.
 
संकट कटै मिटै सब पीरा,
जो सुमिरै हनुमत बलबीरा.
 
जै जै जै हनुमान गोसाईं,
कृपा करहु गुरुदेव की नाईं.
 
जो सत बार पाठ कर कोई,
छूटहि बंदि महा सुख होई.
 
जो यह पढ़ै हनुमान चालीसा,
होय सिद्धि साखी गौरीसा.
 
तुलसीदास सदा हरि चेरा,
कीजै नाथ हृदय मंह डेरा.`,
		dohaBottom: `पवन तनय संकट हरन, मंगल मूरति रूप.
राम लखन सीता सहित, हृदय बसहु सुर भूप.`,
	},
	english: {
		dohaTop: `Sri Guru Charan Saroj Raj Nij Man Mukur Sudhari, Baranau Raghuvar Bimal Jasu Jo Dayaku Phal Chari.

Buddhiheen Tanu Janike Sumarau Pavan Kumar, Bal Buddhi Vidya Dehu Mohi Harau Kalesh Vikar.`,
		chopai: `Jai Hanuman gyan gun sagar,
Jai Kapis tihun lok ujagar.

Ram doot atulit bal dhama,

Anjaani putra Pavan sut nama.

Mahabir Bikram Bajrangi,

Kumati nivar sumati ke sangi.

Kanchan varan viraj subesa,

Kanan kundal kunchit kesa.

Hath vajra aur dhvaja viraje,

Kaandhe moonj janeyu saje.

Shankar suvan kesri nandan,

Tej pratap maha jag vandan.

Vidyavan guni ati chatur,

Ram kaj karibe ko aatur.

Prabu charitra sunibe ko rasiya,

Ram Lakhan Sita man basiya.

Sukshma roop dhari siyahi dikhava,

Vikat roop dhari lank jarava.

Bhima roop dhari asur sanghare,

Ramachandra ke kaj sanvare.

Laye Sanjivan Lakhan jiyaye,

Shri Raghuvir harashi ur laye.

Raghupati kinhi bahut badai,

Tum mam priye Bharat hi sam bhai.

Sahas badan tumharo yash gaave,

Asa kahi Shripati kanth lagaave.

Sankadhik Brahmadi Muneesa,

Narad Saarad sahit Aheesa.

Yam Kuber Digpaal jahan te,

Kavi Kovid kahi sake kahan te.

Tum upkar Sugreevahin keenha,

Ram milaye rajpad deenha.

Tumharo mantra Vibheeshan maana,

Lankeshwar bhaye sab jag jana.

Yug sahastra jojan par Bhanu,

Leelyo tahi madhur phal janu.

Prabhu mudrika meli mukh mahee,

Jaladhi langhi gaye achraj nahee.

Durgam kaj jagath ke jete,

Sugam anugraha tumhre tete.

Ram dwaare tum rakhvare,

Hoat na agya binu paisare.

Sub sukh lahae tumhari sar na,

Tum rakshak kahu ko dar naa.

Aapan tej samharo aapai,

Teenhon lok hank te kanpai.

Bhoot pisaach nikat nahin aavai,

Mahavir jab naam sunave.

Nase rog harae sab peera,

Japat nirantar Hanumant beera.

Sankat te Hanuman chudavae,

Man kram vachan dhyan jo lavai.

Sab par Ram tapasvee raja,

Tin ke kaj sakal Tum saja.

Aur manorath jo koi lavai,

Soi amit jeevan phal pavai.

Charon jug partap tumhara,

Hai persidh jagat ujiyara.

Sadhu Sant ke tum rakhware,

Asur nikandan Ram dulhare.

Ashta sidhi nav nidhi ke dhata,

As var deen Janki mata.

Ram rasayan tumhare pasa,

Sada raho Raghupati ke dasa.

Tumhare bhajan Ram ko pavai,

Janam janam ke dukh bisraavai.

Anth kaal Raghuvir pur jayee,

Jahan janam Hari Bakht Kahayee.

Aur Devta chit na dharahi,

Hanumanth sehi sarve sukh karehi.

Sankat kate mite sab peera,

Jo sumirai Hanumat balbeera.

Jai Jai Jai Hanuman Gosayin,

Kripa karahu Gurudev ki nyahin.

Jo sat bar path kare kohi,

Chutahi bandhi maha sukh hohi.

Jo yah padhe Hanuman Chalisa,

Hoye siddhi sakhi Gaurisa.

Tulsidas sada hari chera,

Keejai nath hridaye mein dera.`,
		dohaBottom: `Pavan tanay sankat harana, Mangal moorati roop.

Ram Lakhan Sita sahit, Hridaya basahu sur bhoop.`,
	},
	kannada: {
		dohaTop: `ಶ್ರೀ ಗುರು ಚರಣ ಸರೋಜ ರಜ ನಿಜಮನ ಮುಕುರ ಸುಧಾರಿ,
ವರಣೌ ರಘುವರ ವಿಮಲಯಶ ಜೋ ದಾಯಕ ಫಲಚಾರಿ.
ಬುದ್ಧಿಹೀನ ತನುಜಾನಿಕೈ ಸುಮಿರೌ ಪವನ ಕುಮಾರ,
ಬಲ ಬುದ್ಧಿ ವಿದ್ಯಾ ದೇಹು ಮೋಹಿ ಹರಹು ಕಲೇಶ ವಿಕಾರ.`,
		chopai: `ಜಯ ಹನುಮಾನ ಜ್ಞಾನ ಗುಣ ಸಾಗರ,
ಜಯ ಕಪೀಶ ತಿಹು ಲೋಕ ಉಜಾಗರ.

ರಾಮದೂತ ಅತುಲಿತ ಬಲಧಾಮಾ,
ಅಂಜನಿ ಪುತ್ರ ಪವನಸುತ ನಾಮಾ.

ಮಹಾವೀರ ವಿಕ್ರಮ ಬಜರಂಗೀ,
ಕುಮತಿ ನಿವಾರ ಸುಮತಿ ಕೇ ಸಂಗೀ.

ಕಂಚನ ವರಣ ವಿರಾಜ ಸುವೇಶಾ,
ಕಾನನ ಕುಂಡಲ ಕುಂಚಿತ ಕೇಶಾ.

ಹಾಥವಜ್ರ ಔ ಧ್ವಜಾ ವಿರಾಜೈ,
ಕಾಂಥೇ ಮೂಂಜ ಜನೇವೂ ಸಾಜೈ.

ಶಂಕರ ಸುವನ ಕೇಸರೀ ನಂದನ,
ತೇಜ ಪ್ರತಾಪ ಮಹಾಜಗ ವಂದನ.

ವಿದ್ಯಾವಾನ ಗುಣೀ ಅತಿ ಚಾತುರ,
ರಾಮ ಕಾಜ ಕರಿವೇ ಕೋ ಆತುರ.

ಪ್ರಭು ಚರಿತ್ರ ಸುನಿವೇ ಕೋ ರಸಿಯಾ,
ರಾಮಲಖನ ಸೀತಾ ಮನ ಬಸಿಯಾ.

ಸೂಕ್ಷ್ಮ ರೂಪಧರಿ ಸಿಯಹಿ ದಿಖಾವಾ,
ವಿಕಟ ರೂಪಧರಿ ಲಂಕ ಜಲಾವಾ.

ಭೀಮ ರೂಪಧರಿ ಅಸುರ ಸಂಹಾರೇ,
ರಾಮಚಂದ್ರ ಕೇ ಕಾಜ ಸಂವಾರೇ.

ಲಾಯ ಸಂಜೀವನ ಲಖನ ಜಿಯಾಯೇ,
ಶ್ರೀ ರಘುವೀರ ಹರಷಿ ಉರಲಾಯೇ.

ರಘುಪತಿ ಕೀನ್ಹೀ ಬಹುತ ಬಡಾಯೀ,
ತುಮ ಮಮ ಪ್ರಿಯ ಭರತ ಸಮ ಭಾಯೀ.

ಸಹಸ್ರ ವದನ ತುಮ್ಹರೋ ಯಶಗಾವೈ,
ಅಸ ಕಹಿ ಶ್ರೀಪತಿ ಕಂಠ ಲಗಾವೈ.

ಸನಕಾದಿಕ ಬ್ರಹ್ಮಾದಿ ಮುನೀಶಾ,
ನಾರದ ಶಾರದ ಸಹಿತ ಅಹೀಶಾ.

ಯಮ ಕುಬೇರ ದಿಗಪಾಲ ಜಹಾಂ ತೇ,
ಕವಿ ಕೋವಿದ ಕಹಿ ಸಕೇ ಕಹಾಂ ತೇ.

ತುಮ ಉಪಕಾರ ಸುಗ್ರೀವಹಿ ಕೀನ್ಹಾ,
ರಾಮ ಮಿಲಾಯ ರಾಜಪದ ದೀನ್ಹಾ.

ತುಮ್ಹರೋ ಮಂತ್ರ ವಿಭೀಷಣ ಮಾನಾ,
ಲಂಕೇಶ್ವರ ಭಯೇ ಸಬ ಜಗ ಜಾನಾ.

ಯುಗ ಸಹಸ್ರ ಯೋಜನ ಪರ ಭಾನೂ,
ಲೀಲ್ಯೋ ತಾಹಿ ಮಧುರ ಫಲ ಜಾನೂ.

ಪ್ರಭು ಮುದ್ರಿಕಾ ಮೇಲಿ ಮುಖ ಮಾಹೀ,
ಜಲಧಿ ಲಾಂಘಿ ಗಯೇ ಅಚರಜ ನಾಹೀ.

ದುರ್ಗಮ ಕಾಜ ಜಗತ ಕೇ ಜೇತೇ,
ಸುಗಮ ಅನುಗ್ರಹ ತುಮ್ಹರೇ ತೇತೇ.

ರಾಮ ದುಆರೇ ತುಮ ರಖವಾರೇ,
ಹೋತ ನ ಆಜ್ಞಾ ಬಿನು ಪೈಸಾರೇ.

ಸಬ ಸುಖ ಲಹೈ ತುಮ್ಹಾರೀ ಶರಣಾ,
ತುಮ ರಕ್ಷಕ ಕಾಹೂ ಕೋ ಡರ ನಾ.

ಆಪನ ತೇಜ ಸಮ್ಹಾರೋ ಆಪೈ,
ತೀನೋಂ ಲೋಕ ಹಾಂಕ ತೇ ಕಾಂಪೈ.

ಭೂತ ಪಿಶಾಚ ನಿಕಟ ನಹಿ ಆವೈ,
ಮಹವೀರ ಜಬ ನಾಮ ಸುನಾವೈ.

ನಾಸೈ ರೋಗ ಹರೈ ಸಬ ಪೀರಾ,
ಜಪತ ನಿರಂತರ ಹನುಮತ ವೀರಾ.

ಸಂಕಟ ಸೇ ಹನುಮಾನ ಛುಡಾವೈ,
ಮನ ಕ್ರಮ ವಚನ ಧ್ಯಾನ ಜೋ ಲಾವೈ.

ಸಬ ಪರ ರಾಮ ತಪಸ್ವೀ ರಾಜಾ,
ತಿನಕೇ ಕಾಜ ಸಕಲ ತುಮ ಸಾಜಾ.

ಔರ ಮನೋರಧ ಜೋ ಕೋಯಿ ಲಾವೈ,
ತಾಸು ಅಮಿತ ಜೀವನ ಫಲ ಪಾವೈ.

ಚಾರೋ ಯುಗ ಪ್ರತಾಪ ತುಮ್ಹಾರಾ,
ಹೈ ಪ್ರಸಿದ್ಧ ಜಗತ ಉಜಿಯಾರಾ.

ಸಾಧು ಸಂತ ಕೇ ತುಮ ರಖವಾರೇ,
ಅಸುರ ನಿಕಂದನ ರಾಮ ದುಲಾರೇ.

ಅಷ್ಠಸಿದ್ಧಿ ನವ ನಿಧಿ ಕೇ ದಾತಾ,
ಅಸ ವರ ದೀನ್ಹ ಜಾನಕೀ ಮಾತಾ.

ರಾಮ ರಸಾಯನ ತುಮ್ಹಾರೇ ಪಾಸಾ,
ಸದಾ ರಹೋ ರಘುಪತಿ ಕೇ ದಾಸಾ.

ತುಮ್ಹರೇ ಭಜನ ರಾಮಕೋ ಪಾವೈ,
ಜನ್ಮ ಜನ್ಮ ಕೇ ದುಖ ಬಿಸರಾವೈ.

ಅಂತ ಕಾಲ ರಘುಪತಿ ಪುರಜಾಯೀ,
ಜಹಾಂ ಜನ್ಮ ಹರಿಭಕ್ತ ಕಹಾಯೀ.

ಔರ ದೇವತಾ ಚಿತ್ತ ನ ಧರಯೀ,
ಹನುಮತ ಸೇಯಿ ಸರ್ವ ಸುಖ ಕರಯೀ.

ಸಂಕಟ ಕ(ಹ)ಟೈ ಮಿಟೈ ಸಬ ಪೀರಾ,
ಜೋ ಸುಮಿರೈ ಹನುಮತ ಬಲ ವೀರಾ.

ಜೈ ಜೈ ಜೈ ಹನುಮಾನ ಗೋಸಾಯೀ,
ಕೃಪಾ ಕರಹು ಗುರುದೇವ ಕೀ ನಾಯೀ.

ಜೋ ಶತ ವಾರ ಪಾಠ ಕರ ಕೋಯೀ,
ಛೂಟಹಿ ಬಂದಿ ಮಹಾ ಸುಖ ಹೋಯೀ.

ಜೋ ಯಹ ಪಡೈ ಹನುಮಾನ ಚಾಲೀಸಾ,
ಹೋಯ ಸಿದ್ಧಿ ಸಾಖೀ ಗೌರೀಶಾ.

ತುಲಸೀದಾಸ ಸದಾ ಹರಿ ಚೇರಾ,
ಕೀಜೈ ನಾಥ ಹೃದಯ ಮಹ ಡೇರಾ.`,

		dohaBottom: `
ಪವನತನಯ ಸಂಕಟ ಹರಣ,
ಮಂಗಳ ಮೂರತಿ ರೂಪ.
ರಾಮ ಲಖನ ಸೀತಾ ಸಹಿತ,
ಹೃದಯ ಬಸಹು ಸುರ ಭೂಪ.`,
	},
	konkani: {
		dohaTop: `श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि.
बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि.`,
		chopai: `जय हनुमान ज्ञान गुन सागर,
जय कपीस तिहुं लोक उजागर.
 
रामदूत अतुलित बल धामा,
अंजनि-पुत्र पवनसुत नामा.
 
महाबीर बिक्रम बजरंगी,
कुमति निवार सुमति के संगी.
 
कंचन बरन बिराज सुबेसा,
कानन कुंडल कुंचित केसा.
 
हाथ बज्र औ ध्वजा बिराजै,
कांधे मूंज जनेऊ साजै.
 
संकर सुवन केसरीनंदन,
तेज प्रताप महा जग बन्दन.
 
विद्यावान गुनी अति चातुर,
राम काज करिबे को आतुर.
 
प्रभु चरित्र सुनिबे को रसिया,
राम लखन सीता मन बसिया.
 
सूक्ष्म रूप धरि सियहिं दिखावा,
बिकट रूप धरि लंक जरावा.
 
भीम रूप धरि असुर संहारे,
रामचंद्र के काज संवारे.
 
लाय सजीवन लखन जियाये,
श्रीरघुबीर हरषि उर लाये.
 
रघुपति कीन्ही बहुत बड़ाई,
तुम मम प्रिय भरतहि सम भाई.
 
सहस बदन तुम्हरो जस गावैं,
अस कहि श्रीपति कंठ लगावैं.
 
सनकादिक ब्रह्मादि मुनीसा,
नारद सारद सहित अहीसा.
 
जम कुबेर दिगपाल जहां ते,
कबि कोबिद कहि सके कहां ते.
 
तुम उपकार सुग्रीवहिं कीन्हा,
राम मिलाय राज पद दीन्हा.
 
तुम्हरो मंत्र बिभीषन माना,
लंकेस्वर भए सब जग जाना.
 
जुग सहस्र जोजन पर भानू,
लील्यो ताहि मधुर फल जानू.
 
प्रभु मुद्रिका मेलि मुख माहीं,
जलधि लांघि गये अचरज नाहीं.
 
दुर्गम काज जगत के जेते,
सुगम अनुग्रह तुम्हरे तेते.
 
राम दुआरे तुम रखवारे,
होत न आज्ञा बिनु पैसारे.
 
सब सुख लहै तुम्हारी सरना,
तुम रक्षक काहू को डर ना.
 
आपन तेज सम्हारो आपै,
तीनों लोक हांक तें कांपै.
 
भूत पिसाच निकट नहिं आवै,
महाबीर जब नाम सुनावै.
 
नासै रोग हरै सब पीरा,
जपत निरंतर हनुमत बीरा.
 
संकट तें हनुमान छुड़ावै,
मन क्रम बचन ध्यान जो लावै.
 
सब पर राम तपस्वी राजा,
तिन के काज सकल तुम साजा.
 
और मनोरथ जो कोई लावै,
सोइ अमित जीवन फल पावै.
 
चारों जुग परताप तुम्हारा,
है परसिद्ध जगत उजियारा.
 
साधु-संत के तुम रखवारे,
असुर निकंदन राम दुलारे.
 
अष्ट सिद्धि नौ निधि के दाता,
अस बर दीन जानकी माता.
 
राम रसायन तुम्हरे पासा,
सदा रहो रघुपति के दासा.
 
तुम्हरे भजन राम को पावै,
जनम-जनम के दुख बिसरावै.
 
अन्तकाल रघुबर पुर जाई,
जहां जन्म हरि-भक्त कहाई.
 
और देवता चित्त न धरई,
हनुमत सेइ सर्ब सुख करई.
 
संकट कटै मिटै सब पीरा,
जो सुमिरै हनुमत बलबीरा.
 
जै जै जै हनुमान गोसाईं,
कृपा करहु गुरुदेव की नाईं.
 
जो सत बार पाठ कर कोई,
छूटहि बंदि महा सुख होई.
 
जो यह पढ़ै हनुमान चालीसा,
होय सिद्धि साखी गौरीसा.
 
तुलसीदास सदा हरि चेरा,
कीजै नाथ हृदय मंह डेरा.`,
		dohaBottom: `पवन तनय संकट हरन, मंगल मूरति रूप.
राम लखन सीता सहित, हृदय बसहु सुर भूप.`,
	},
	oriya: {
		dohaTop: `ଶ୍ରୀ ଗୁରୁ ଚରଣ ସରୋଜ ରଜ ନିଜମନ ମୁକୁର ସୁଧାରି,
ଵରଣୌ ରଘୁଵର ଵିମଲଯଶ ଜୋ ଦାଯକ ଫଲଚାରି.
ବୁଦ୍ଧିହୀନ ତନୁଜାନିକୈ ସୁମିରୌ ପଵନ କୁମାର,
ବଲ ବୁଦ୍ଧି ଵିଦ୍ଯା ଦେହୁ ମୋହି ହରହୁ କଲେଶ ଵିକାର.`,
		chopai: `ଜଯ ହନୁମାନ ଜ୍ଞାନ ଗୁଣ ସାଗର,
ଜଯ କପୀଶ ତିହୁ ଲୋକ ଉଜାଗର.

ରାମଦୂତ ଅତୁଲିତ ବଲଧାମା,
ଅଂଜନି ପୁତ୍ର ପଵନସୁତ ନାମା.

ମହାଵୀର ଵିକ୍ରମ ବଜରଂଗୀ,
କୁମତି ନିଵାର ସୁମତି କେ ସଂଗୀ.

କଂଚନ ଵରଣ ଵିରାଜ ସୁଵେଶା,
କାନନ କୁଂଡଲ କୁଂଚିତ କେଶା.

ହାଥଵଜ୍ର ଔ ଧ୍ଵଜା ଵିରାଜୈ,
କାଂଥେ ମୂଂଜ ଜନେଵୂ ସାଜୈ.

ଶଂକର ସୁଵନ କେସରୀ ନଂଦନ,
ତେଜ ପ୍ରତାପ ମହାଜଗ ଵଂଦନ.

ଵିଦ୍ଯାଵାନ ଗୁଣୀ ଅତି ଚାତୁର,
ରାମ କାଜ କରିଵେ କୋ ଆତୁର.

ପ୍ରଭୁ ଚରିତ୍ର ସୁନିଵେ କୋ ରସିଯା,
ରାମଲଖନ ସୀତା ମନ ବସିଯା.

ସୂକ୍ଷ୍ମ ରୂପଧରି ସିଯହି ଦିଖାଵା,
ଵିକଟ ରୂପଧରି ଲଂକ ଜଲାଵା.

ଭୀମ ରୂପଧରି ଅସୁର ସଂହାରେ,
ରାମଚଂଦ୍ର କେ କାଜ ସଂଵାରେ.

ଲାଯ ସଂଜୀଵନ ଲଖନ ଜିଯାଯେ,
ଶ୍ରୀ ରଘୁଵୀର ହରଷି ଉରଲାଯେ.

ରଘୁପତି କୀନ୍ହୀ ବହୁତ ବଡାଯୀ,
ତୁମ ମମ ପ୍ରିଯ ଭରତ ସମ ଭାଯୀ.

ସହସ୍ର ଵଦନ ତୁମ୍ହରୋ ଯଶଗାଵୈ,
ଅସ କହି ଶ୍ରୀପତି କଂଠ ଲଗାଵୈ.

ସନକାଦିକ ବ୍ରହ୍ମାଦି ମୁନୀଶା,
ନାରଦ ଶାରଦ ସହିତ ଅହୀଶା.

ଯମ କୁବେର ଦିଗପାଲ ଜହାଂ ତେ,
କଵି କୋଵିଦ କହି ସକେ କହାଂ ତେ.

ତୁମ ଉପକାର ସୁଗ୍ରୀଵହି କୀନ୍ହା,
ରାମ ମିଲାଯ ରାଜପଦ ଦୀନ୍ହା.

ତୁମ୍ହରୋ ମଂତ୍ର ଵିଭୀଷଣ ମାନା,
ଲଂକେଶ୍ଵର ଭଯେ ସବ ଜଗ ଜାନା.

ଯୁଗ ସହସ୍ର ଯୋଜନ ପର ଭାନୂ,
ଲୀଲ୍ଯୋ ତାହି ମଧୁର ଫଲ ଜାନୂ.

ପ୍ରଭୁ ମୁଦ୍ରିକା ମେଲି ମୁଖ ମାହୀ,
ଜଲଧି ଲାଂଘି ଗଯେ ଅଚରଜ ନାହୀ.

ଦୁର୍ଗମ କାଜ ଜଗତ କେ ଜେତେ,
ସୁଗମ ଅନୁଗ୍ରହ ତୁମ୍ହରେ ତେତେ.

ରାମ ଦୁଆରେ ତୁମ ରଖଵାରେ,
ହୋତ ନ ଆଜ୍ଞା ବିନୁ ପୈସାରେ.

ସବ ସୁଖ ଲହୈ ତୁମ୍ହାରୀ ଶରଣା,
ତୁମ ରକ୍ଷକ କାହୂ କୋ ଡର ନା.

ଆପନ ତେଜ ସମ୍ହାରୋ ଆପୈ,
ତୀନୋଂ ଲୋକ ହାଂକ ତେ କାଂପୈ.

ଭୂତ ପିଶାଚ ନିକଟ ନହି ଆଵୈ,
ମହଵୀର ଜବ ନାମ ସୁନାଵୈ.

ନାସୈ ରୋଗ ହରୈ ସବ ପୀରା,
ଜପତ ନିରଂତର ହନୁମତ ଵୀରା.

ସଂକଟ ସେ ହନୁମାନ ଛୁଡାଵୈ,
ମନ କ୍ରମ ଵଚନ ଧ୍ଯାନ ଜୋ ଲାଵୈ.

ସବ ପର ରାମ ତପସ୍ଵୀ ରାଜା,
ତିନକେ କାଜ ସକଲ ତୁମ ସାଜା.

ଔର ମନୋରଧ ଜୋ କୋଯି ଲାଵୈ,
ତାସୁ ଅମିତ ଜୀଵନ ଫଲ ପାଵୈ.

ଚାରୋ ଯୁଗ ପ୍ରତାପ ତୁମ୍ହାରା,
ହୈ ପ୍ରସିଦ୍ଧ ଜଗତ ଉଜିଯାରା.

ସାଧୁ ସଂତ କେ ତୁମ ରଖଵାରେ,
ଅସୁର ନିକଂଦନ ରାମ ଦୁଲାରେ.

ଅଷ୍ଠସିଦ୍ଧି ନଵ ନିଧି କେ ଦାତା,
ଅସ ଵର ଦୀନ୍ହ ଜାନକୀ ମାତା.

ରାମ ରସାଯନ ତୁମ୍ହାରେ ପାସା,
ସଦା ରହୋ ରଘୁପତି କେ ଦାସା.

ତୁମ୍ହରେ ଭଜନ ରାମକୋ ପାଵୈ,
ଜନ୍ମ ଜନ୍ମ କେ ଦୁଖ ବିସରାଵୈ.

ଅଂତ କାଲ ରଘୁପତି ପୁରଜାଯୀ,
ଜହାଂ ଜନ୍ମ ହରିଭକ୍ତ କହାଯୀ.

ଔର ଦେଵତା ଚିତ୍ତ ନ ଧରଯୀ,
ହନୁମତ ସେଯି ସର୍ଵ ସୁଖ କରଯୀ.

ସଂକଟ କ(ହ)ଟୈ ମିଟୈ ସବ ପୀରା,
ଜୋ ସୁମିରୈ ହନୁମତ ବଲ ଵୀରା.

ଜୈ ଜୈ ଜୈ ହନୁମାନ ଗୋସାଯୀ,
କୃପା କରହୁ ଗୁରୁଦେଵ କୀ ନାଯୀ.

ଜୋ ଶତ ଵାର ପାଠ କର କୋଯୀ,
ଛୂଟହି ବଂଦି ମହା ସୁଖ ହୋଯୀ.

ଜୋ ଯହ ପଡୈ ହନୁମାନ ଚାଲୀସା,
ହୋଯ ସିଦ୍ଧି ସାଖୀ ଗୌରୀଶା.

ତୁଲସୀଦାସ ସଦା ହରି ଚେରା,
କୀଜୈ ନାଥ ହୃଦଯ ମହ ଡେରା.`,
		dohaBottom: `ପଵନ ତନଯ ସଂକଟ ହରଣ - ମଂଗଳ ମୂରତି ରୂପ୍,
ରାମ ଲଖନ ସୀତା ସହିତ - ହୃଦଯ ବସହୁ ସୁରଭୂପ୍.
`,
	},
	bengali: {
		dohaTop: `শ্রী গুরু চরণ সরোজ রজ নিজমন মুকুর সুধারি,
বরণৌ রঘুবর বিমলযশ জো দাযক ফলচারি.
বুদ্ধিহীন তনুজানিকৈ সুমিরৌ পবন কুমার,
বল বুদ্ধি বিদ্যা দেহু মোহি হরহু কলেশ বিকার.`,
		chopai: `জয হনুমান জ্ঞান গুণ সাগর,
জয কপীশ তিহু লোক উজাগর.

রামদূত অতুলিত বলধামা,
অংজনি পুত্র পবনসুত নামা.

মহাবীর বিক্রম বজরংগী,
কুমতি নিবার সুমতি কে সংগী.

কংচন বরণ বিরাজ সুবেশা,
কানন কুংডল কুংচিত কেশা.

হাথবজ্র ঔ ধ্বজা বিরাজৈ,
কাংথে মূংজ জনেবূ সাজৈ.

শংকর সুবন কেসরী নংদন,
তেজ প্রতাপ মহাজগ বংদন.

বিদ্যাবান গুণী অতি চাতুর,
রাম কাজ করিবে কো আতুর.

প্রভু চরিত্র সুনিবে কো রসিযা,
রামলখন সীতা মন বসিযা.

সূক্ষ্ম রূপধরি সিযহি দিখাবা,
বিকট রূপধরি লংক জলাবা.

ভীম রূপধরি অসুর সংহারে,
রামচংদ্র কে কাজ সংবারে.

লায সংজীবন লখন জিযাযে,
শ্রী রঘুবীর হরষি উরলাযে.

রঘুপতি কীন্হী বহুত বডাযী,
তুম মম প্রিয ভরত সম ভাযী.

সহস্র বদন তুম্হরো যশগাবৈ,
অস কহি শ্রীপতি কংঠ লগাবৈ.

সনকাদিক ব্রহ্মাদি মুনীশা,
নারদ শারদ সহিত অহীশা.

যম কুবের দিগপাল জহাং তে,
কবি কোবিদ কহি সকে কহাং তে.

তুম উপকার সুগ্রীবহি কীন্হা,
রাম মিলায রাজপদ দীন্হা.

তুম্হরো মংত্র বিভীষণ মানা,
লংকেশ্বর ভযে সব জগ জানা.

যুগ সহস্র যোজন পর ভানূ,
লীল্যো তাহি মধুর ফল জানূ.

প্রভু মুদ্রিকা মেলি মুখ মাহী,
জলধি লাংঘি গযে অচরজ নাহী.

দুর্গম কাজ জগত কে জেতে,
সুগম অনুগ্রহ তুম্হরে তেতে.

রাম দুআরে তুম রখবারে,
হোত ন আজ্ঞা বিনু পৈসারে.

সব সুখ লহৈ তুম্হারী শরণা,
তুম রক্ষক কাহূ কো ডর না.

আপন তেজ সম্হারো আপৈ,
তীনোং লোক হাংক তে কাংপৈ.

ভূত পিশাচ নিকট নহি আবৈ,
মহবীর জব নাম সুনাবৈ.

নাসৈ রোগ হরৈ সব পীরা,
জপত নিরংতর হনুমত বীরা.

সংকট সে হনুমান ছুডাবৈ,
মন ক্রম বচন ধ্যান জো লাবৈ.

সব পর রাম তপস্বী রাজা,
তিনকে কাজ সকল তুম সাজা.

ঔর মনোরধ জো কোযি লাবৈ,
তাসু অমিত জীবন ফল পাবৈ.

চারো যুগ প্রতাপ তুম্হারা,
হৈ প্রসিদ্ধ জগত উজিযারা.

সাধু সংত কে তুম রখবারে,
অসুর নিকংদন রাম দুলারে.

অষ্ঠসিদ্ধি নব নিধি কে দাতা,
অস বর দীন্হ জানকী মাতা.

রাম রসাযন তুম্হারে পাসা,
সদা রহো রঘুপতি কে দাসা.

তুম্হরে ভজন রামকো পাবৈ,
জন্ম জন্ম কে দুখ বিসরাবৈ.

অংত কাল রঘুপতি পুরজাযী,
জহাং জন্ম হরিভক্ত কহাযী.

ঔর দেবতা চিত্ত ন ধরযী,
হনুমত সেযি সর্ব সুখ করযী.

সংকট ক(হ)টৈ মিটৈ সব পীরা,
জো সুমিরৈ হনুমত বল বীরা.

জৈ জৈ জৈ হনুমান গোসাযী,
কৃপা করহু গুরুদেব কী নাযী.

জো শত বার পাঠ কর কোযী,
ছূটহি বংদি মহা সুখ হোযী.

জো যহ পডৈ হনুমান চালীসা,
হোয সিদ্ধি সাখী গৌরীশা.

তুলসীদাস সদা হরি চেরা,
কীজৈ নাথ হৃদয মহ ডেরা`,
		dohaBottom: `পবন তনয সংকট হরণ - মংগল মূরতি রূপ্,
রাম লখন সীতা সহিত - হৃদয বসহু সুরভূপ্.`,
	},
	tamil: {
		dohaTop: `ஶ்ரீ குரு சரண ஸரோஜ ரஜ னிஜமன முகுர ஸுதாரி,
வரணௌ ரகுவர விமலயஶ ஜோ தாயக பலசாரி.
புத்திஹீந தநுஜாநிகை ஸுமிரௌ பவந குமார,
பல புத்தி வித்யா தேஹு மோஹி ஹரஹு கலேஶ விகார்.`,
		chopai: `ஜய ஹநுமாந ஜ்ஞாந குண ஸாகர,
ஜய கபீஶ திஹு லோக உஜாகர

ராமதூத அதுலித பலதாமா,
அஂஜநி புத்ர பவநஸுத நாமா,

மஹாவீர விக்ரம பஜரங்கீ,
குமதி நிவார ஸுமதி கே ஸங்கீ.

கஂசந வரண விராஜ ஸுவேஶா,
காநந குண்டல குஂசித கேஶா.

ஹாதவஜ்ர ஔ த்வஜா விராஜை,
காந்தே மூஂஜ ஜநேவூ ஸாஜை.

ஶஂகர ஸுவந கேஸரீ நந்தந,
தேஜ ப்ரதாப மஹாஜக வந்தந.

வித்யாவாந குணீ அதி சாதுர,
ராம காஜ கரிவே கோ ஆதுர.

ப்ரபு சரித்ர ஸுநிவே கோ ரஸியா,
ராமலகந ஸீதா மந பஸியா.

ஸூக்ஷ்ம ரூபதரி ஸியஹி திகாவா,
விகட ரூபதரி லஂக ஜலாவா.

பீம ரூபதரி அஸுர ஸம்ஹாரே,
ராமசந்த்ர கே காஜ ஸம்வாரே.

லாய ஸஂஜீவந லகந ஜியாயே,
ஶ்ரீ ரகுவீர ஹரஷி உரலாயே.

ரகுபதி கீந்ஹீ பஹுத படாயீ,
தும மம ப்ரிய பரத ஸம பாயீ.

ஸஹஸ்ர வதந தும்ஹரோ யஶகாவை,
அஸ கஹி ஶ்ரீபதி கண்ட லகாவை.

ஸநகாதிக ப்ரஹ்மாதி முநீஶா,
நாரத ஶாரத ஸஹித அஹீஶா.

யம குபேர திகபால ஜஹாம் தே,
கவி கோவித கஹி ஸகே கஹாம் தே.

தும உபகார ஸுக்ரீவஹி கீந்ஹா,
ராம மிலாய ராஜபத தீந்ஹா.

தும்ஹரோ மந்த்ர விபீஷண மாநா,
லஂகேஶ்வர பயே ஸப ஜக ஜாநா.

யுக ஸஹஸ்ர யோஜந பர பாநூ,
லீல்யோ தாஹி மதுர பல ஜாநூ.

ப்ரபு முத்ரிகா மேலி முக மாஹீ,
ஜலதி லாங்கி கயே அசரஜ நாஹீ.

துர்கம காஜ ஜகத கே ஜேதே,
ஸுகம அநுக்ரஹ தும்ஹரே தேதே.

ராம துஆரே தும ரகவாரே,
ஹோத ந ஆஜ்ஞா பிநு பைஸாரே.

ஸப ஸுக லஹை தும்ஹாரீ ஶரணா,
தும ரக்ஷக காஹூ கோ டர நா.

ஆபந தேஜ ஸம்ஹாரோ ஆபை,
தீநோம் லோக ஹாஂக தே காம்பை.

பூத பிஶாச நிகட நஹி ஆவை,
மஹவீர ஜப நாம ஸுநாவை.

நாஸை ரோக ஹரை ஸப பீரா,
ஜபத நிரந்தர ஹநுமத வீரா.

ஸஂகட ஸே ஹநுமாந சுடாவை,
மந க்ரம வசந த்யாந ஜோ லாவை.

ஸப பர ராம தபஸ்வீ ராஜா,
திநகே காஜ ஸகல தும ஸாஜா.

ஔர மநோரத ஜோ கோயி லாவை,
தாஸு அமித ஜீவந பல பாவை.

சாரோ யுக ப்ரதாப தும்ஹாரா,
ஹை ப்ரஸித்த ஜகத உஜியாரா.

ஸாது ஸந்த கே தும ரகவாரே,
அஸுர நிகந்தந ராம துலாரே.

அஷ்டஸித்தி நவ நிதி கே தாதா,
அஸ வர தீந்ஹ ஜாநகீ மாதா.

ராம ரஸாயந தும்ஹாரே பாஸா,
ஸதா ரஹோ ரகுபதி கே தாஸா.

தும்ஹரே பஜந ராமகோ பாவை,
ஜந்ம ஜந்ம கே துக பிஸராவை.

அந்த கால ரகுபதி புரஜாயீ,
ஜஹாம் ஜந்ம ஹரிபக்த கஹாயீ.

ஔர தேவதா சித்த ந தரயீ,
ஹநுமத ஸேயி ஸர்வ ஸுக கரயீ.

ஸஂகட க(ஹ)டை மிடை ஸப பீரா,
ஜோ ஸுமிரை ஹநுமத பல வீரா.

ஜை ஜை ஜை ஹநுமாந கோஸாயீ,
க்ருபா கரஹு குருதேவ கீ நாயீ.

ஜோ ஶத வார பாட கர கோயீ,
சூடஹி பந்தி மஹா ஸுக ஹோயீ.

ஜோ யஹ படை ஹநுமாந சாலீஸா,
ஹோய ஸித்தி ஸாகீ கௌரீஶா.absolute-center

துலஸீதாஸ ஸதா ஹரி சேரா,
கீஜை நாத ஹ்ருதய மஹ டேரா.`,
		dohaBottom: ``,
	},

	telgu: {
		dohaTop: `శ్రీ గురు చరణ సరోజ రజ నిజమన ముకుర సుధారి,
వరణౌ రఘువర విమలయశ జో దాయక ఫలచారి.
బుద్ధిహీన తనుజానికై సుమిరౌ పవన కుమార,
బల బుద్ధి విద్యా దేహు మోహి హరహు కలేశ వికార.`,
		chopai: `జయ హనుమాన జ్ఞాన గుణ సాగర,
జయ కపీశ తిహు లోక ఉజాగర.

రామదూత అతులిత బలధామా,
అంజని పుత్ర పవనసుత నామా.

మహావీర విక్రమ బజరంగీ,
కుమతి నివార సుమతి కే సంగీ.

కంచన వరణ విరాజ సువేశా,
కానన కుండల కుంచిత కేశా.

హాథవజ్ర ఔ ధ్వజా విరాజై,
కాంథే మూంజ జనేవూ సాజై.

శంకర సువన కేసరీ నందన,
తేజ ప్రతాప మహాజగ వందన.

విద్యావాన గుణీ అతి చాతుర,
రామ కాజ కరివే కో ఆతుర.

ప్రభు చరిత్ర సునివే కో రసియా,
రామలఖన సీతా మన బసియా.

సూక్ష్మ రూపధరి సియహి దిఖావా,
వికట రూపధరి లంక జలావా.

భీమ రూపధరి అసుర సంహారే,
రామచంద్ర కే కాజ సంవారే.

లాయ సంజీవన లఖన జియాయే,
శ్రీ రఘువీర హరషి ఉరలాయే.

రఘుపతి కీన్హీ బహుత బడాయీ,
తుమ మమ ప్రియ భరత సమ భాయీ.

సహస్ర వదన తుమ్హరో యశగావై,
అస కహి శ్రీపతి కంఠ లగావై.

సనకాదిక బ్రహ్మాది మునీశా,
నారద శారద సహిత అహీశా.

యమ కుబేర దిగపాల జహాం తే,
కవి కోవిద కహి సకే కహాం తే.

తుమ ఉపకార సుగ్రీవహి కీన్హా,
రామ మిలాయ రాజపద దీన్హా.

తుమ్హరో మంత్ర విభీషణ మానా,
లంకేశ్వర భయే సబ జగ జానా.

యుగ సహస్ర యోజన పర భానూ,
లీల్యో తాహి మధుర ఫల జానూ.

ప్రభు ముద్రికా మేలి ముఖ మాహీ,
జలధి లాంఘి గయే అచరజ నాహీ.

దుర్గమ కాజ జగత కే జేతే,
సుగమ అనుగ్రహ తుమ్హరే తేతే.

రామ దుఆరే తుమ రఖవారే,
హోత న ఆజ్ఞా బిను పైసారే.

సబ సుఖ లహై తుమ్హారీ శరణా,
తుమ రక్షక కాహూ కో డర నా.

ఆపన తేజ సమ్హారో ఆపై,
తీనోం లోక హాంక తే కాంపై.

భూత పిశాచ నికట నహి ఆవై,
మహవీర జబ నామ సునావై.

నాసై రోగ హరై సబ పీరా,
జపత నిరంతర హనుమత వీరా.

సంకట సే హనుమాన ఛుడావై,
మన క్రమ వచన ధ్యాన జో లావై.

సబ పర రామ తపస్వీ రాజా,
తినకే కాజ సకల తుమ సాజా.

ఔర మనోరధ జో కోయి లావై,
తాసు అమిత జీవన ఫల పావై.

చారో యుగ ప్రతాప తుమ్హారా,
హై ప్రసిద్ధ జగత ఉజియారా.

సాధు సంత కే తుమ రఖవారే,
అసుర నికందన రామ దులారే.

అష్ఠసిద్ధి నవ నిధి కే దాతా,
అస వర దీన్హ జానకీ మాతా.

రామ రసాయన తుమ్హారే పాసా,
సదా రహో రఘుపతి కే దాసా.

తుమ్హరే భజన రామకో పావై,
జన్మ జన్మ కే దుఖ బిసరావై.

అంత కాల రఘుపతి పురజాయీ,
జహాం జన్మ హరిభక్త కహాయీ.

ఔర దేవతా చిత్త న ధరయీ,
హనుమత సేయి సర్వ సుఖ కరయీ.

సంకట క(హ)టై మిటై సబ పీరా,
జో సుమిరై హనుమత బల వీరా.

జై జై జై హనుమాన గోసాయీ,
కృపా కరహు గురుదేవ కీ నాయీ.

జో శత వార పాఠ కర కోయీ,
ఛూటహి బంది మహా సుఖ హోయీ.

జో యహ పడై హనుమాన చాలీసా,
హోయ సిద్ధి సాఖీ గౌరీశా.

తులసీదాస సదా హరి చేరా,
కీజై నాథ హృదయ మహ డేరా`,
		dohaBottom: `పవన తనయ సంకట హరణ - మంగళ మూరతి రూప్,
రామ లఖన సీతా సహిత - హృదయ బసహు సురభూప్.`,
	},
};
